Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: །གང་ཡང་ཁྱོད་ནི་ཡིད་ཀུན་དུ་སྐྲག་པར་བྱེད་པ་རྣམས་ལ་མི་འཇིགས་པས་ཁྱོད་ཀྱི་འབད་པ་འདི་ཉིད་ཀྱིས་ཡུན་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: You are not afraid of anyone who attempts to frighten you. Due to your efforts, you will, therefore, attain unsurpassed and perfect awakening in a short while.’ Śakra, lord of the gods, then recited the following verses:

source: ཀྱེ་མ་ཁྱོད་ཀྱི་བརྩོན་རབ་དྲག །བརྟན་པ་ཉིད་ཀྱང་བླ་ན་མེད།
en: “ ‘Ah! Your diligence is great and fierce. Your steadfastness is unsurpassed.

source: །ཀྱེ་མའོ་སེམས་ཅན་ལ་སྙིང་བརྩེ།
en: Ah! Your compassion for beings!

source: །ཀྱེ་མའོ་བྱང་ཆུབ་ཡིད་ལ་བརྟན།
en: Ah! Your determination to awaken!

source: །ཀྱེ་མའོ་མི་རིང་འཇིག་རྟེན་འདི།
en: “ ‘Ah! How wonderful would the world be

source: །མགོན་པོ་ཁྱོད་ཀྱིས་སྐྱོང་གྱུར་ཏེ།
en: If you, lord, were its ruler!

source: །སྡུག་བསྔལ་རྒྱ་མཚོ་དྲག་འཇིགས་ལས།
en: You will travel beyond suffering’s fearful and ferocious ocean;

source: །ཡང་དག་མྱ་ངན་འདའ་བར་མཛད།
en: You will attain nirvāṇa!’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མཆི་མ་ཆར་བཞིན་དུ་འབབ་ཅིང་སྐད་འཛེར་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་བཟོད་པ་གསོལ་བར་བརྩམས་ཏེ།
en: “As he said these words, Śakra, lord of the gods, shed tears like rain, and in a hoarse voice he sought forgiveness from the bodhisattva.

source: རྒྱལ་པོ་ཆེན་པོ་གང་བདག་གིས་ཉམས་བསྐྱེད་པའི་བསམ་པས་ཚོར་བ་དྲག་པོ་ལས་ཀུན་དུ་སྦྱོར་བར་མཛོད་ཅིག །གཞན་ཡང་གང་གི་ཚེ་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་ན་ཡང་བདག་ལ་དགོངས་ཤིག །
en: ‘O Great King,’ he said, ‘thinking that you might meet with failure, I coerced you to suffer excruciating pain. Please forgive me. And please think of me when you attain unsurpassed and perfect awakening.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཀཽ་ཤི་ཀ་བཟོད་ཀྱིས་དེ་བཞིན་དུ་བྱས་ཏེ་ངས་ཀྱང་དྲན་པར་བྱའོ།
en: “ ‘Kauśika,’ replied the bodhisattva, ‘I am patient.

source: །བར་སྐབས་དེར་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་དེ་མ་ཐག་ཏུ་ནམ་མཁའ་ལས་ལྷའི་རིན་པོ་ཆེའི་ཆར་རྣམ་པ་སྣ་ཚོགས་པ་ཡིད་དུ་འོང་བ་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་བབ་པར་གྱུར་ཅིང་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་བར་གྱུར་པ། ལྷའི་སྣང་བ་བས་ཀྱང་གསལ་བར་གྱུར་ཏོ།
en: I will do as you ask and remember you.’ In that instant, due to the bodhisattva’s power, a variety of divine, enchanting, precious gems rained down upon all of Jambudvīpa. All of Jambudvīpa was ornamented by myriad precious stones, and it became even brighter than the realms of the gods.

source: །དེ་ནས་རི་ལ་གནས་པའི་དྲང་སྲོང་དེ་ངོ་མཚར་འདི་ལྟ་བུ་རྨད་དུ་བྱུང་བ་མཐོང་བ་དང་། ངོ་མཚར་གྱིས་བསྡུས་པའི་ཡིད་ཀྱིས་བསམས་པ།
en: “The sage who lived in the mountains had witnessed all these marvels, and he was overwhelmed.

source: སྔོན་མ་བྱུང་བའི་ངོ་མཚར་བྱུང་བ་འདི་ཅི་ཞིག་ཡིན།
en: ‘What are these marvels?’ he thought. ‘Have such marvels ever been seen before?

source: འདི་ལྟ་བུའི་མཐུ་སུའི་ཡིན་སྙམ་མོ།
en: Whose power occasions this?’

source: །དེ་ནས་དྲང་སྲོང་དེ་ལ་བསྟི་གནས་ན་གནས་པའི་ལྷ་གཞན་གྱིས་གཏམ་འདི་རྒྱས་པར་སྨྲས་སོ།
en: “A god who lived in the same place as he told him the story in detail.

source: །དེ་ནས་དྲང་སྲོང་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཤིན་ཏུ་དཀའ་ཞིང་བ་སྤུ་ལྡང་བའི་སྐད་ཐོས་པ་དང་ཡང་དག་པར་དགའ་བས་བ་སྤུ་ལྡང་ཞིང་སེམས་ཅན་ཆེན་པོ་བཀུར་བར་འོས་ཞེས་བསམས་ནས་འཁོར་ལྔ་བརྒྱ་དང་བཙུན་མོ་རྒྱལ་བའི་འོད་ཁྲིད་དེ་རིངས་པ་རིངས་པར་བྱང་ཆུབ་སེམས་དཔའི་ཐད་དུ་ཕྱིན་ནས།
en: As he listened to the story of the bodhisattva’s extraordinary, awe-inspiring austerities, the sage came to genuinely admire him. ‘This great being is worthy of veneration,’ he thought. After that, he hastily led his five-hundred-strong retinue and Queen Jayaprabhā to the bodhisattva.

source: རྒྱལ་བ་དང་ཚེ་འཕེལ་བར་བྱས་ཏེ།
en: There they uttered salutations of victory and long life to the king.

source: བརྒྱ་བྱིན་དང་ལྷན་ཅིག་སྨྲས་པ། ལྷ་ཡི་བུ་མོ་བཟང་འདྲ་བའི། །བུ་མོ་སྡུག་པ་འདི་རྣམས་ལ།
en: In unison with Śakra, the sage said, ‘Lord, you have protected these fine, goddess-like, beautiful women.

source: །མགོན་པོ་ཁྱོད་ཀྱིས་བསྐྱང་བ་དང་། །དགེ་མ་འདི་དང་དགྱེས་པར་མཛོད།
en: Now please enjoy life with this virtuous woman.

source: །ཁྱིམ་ཐབ་མི་འཕྱོ་བཙུན་མོ་སྡུག །འདི་ནི་ཁྱེད་ལ་དབུལ་ལགས་ཀྱིས།
en: I offer you back the beautiful queen. She has not been unhappy with her husband.

source: །ཁྱེད་ཀྱིས་ཡང་ནི་སློང་བ་ལ། །ནམ་དུ་ཡང་ནི་མ་སྩལ་ཅིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དྲང་སྲོང་དེ་དང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་གསོལ་བ་བཏབ་པ་སྙིང་རྗེས་ཅི་ཡང་མི་སྨྲ་བར་ཁས་བླངས་སོ།
en: Please do not give her away again to anyone else who asks for her.’ “The bodhisattva compassionately accepted the request of the sage and Śakra, lord of the gods, by remaining silent.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ལྷའི་བུ་ལས་སྣ་ཚོགས་པ་ལ་སྨྲས་པ།
en: Śakra, lord of the gods, then summoned Viśvakarma, the architect of the gods.

source: ལས་སྣ་ཚོགས་པ་ལྷའི་སེང་གེའི་ཁྲི་མྱུར་དུ་ཤོམས་ཤིག །ང་ཉིད་ཀྱིས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་དབང་བསྐུར་བར་བྱའོ།
en: ‘Viśvakarma,’ he said, ‘please set up a divine lion throne quickly. I would like to honor King Śrīsena myself.’

source: །ཀཽ་ཤི་ཀ་ལེགས་ཀྱིས་དེ་ལྟར་བགྱིའོ།
en: “ ‘That is excellent, Kauśika,’ Viśvakarma responded.

source: །ལྷའི་བུ་ལས་སྣ་ཚོགས་པས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལས་མཉན་ནས་སྐད་ཅིག་མ་དེ་ཉིད་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཉེ་བར་མཛེས་པ། ཀུན་ནས་མུ་ཏིག་དང་། མུ་ཏིག་གི་ཚོགས་ཀྱི་དོ་ཤལ་འཕྱང་བའི་ལྷའི་སེང་གེའི་ཁྲི་མངོན་པར་སྤྲུལ་ཏོ།
en: ‘I will do as you instruct.’ Indeed, at the very moment he was listening to Śakra, lord of the gods, Viśvakarma, the architect of the gods, magically created a lion throne. It was decorated with a variety of precious gems, and it was garlanded with pearls on all sides.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རང་ཉིད་ཀྱི་ལག་པ་གཉིས་ཀྱིས་བཟུང་ནས་ལྷའི་སེང་གེའི་ཁྲི་ལ་བཞག་སྟེ།
en: Śakra, lord of the gods, took the bodhisattva with both his hands and escorted him onto the divine lion throne.

source: ལྷ་བརྒྱ་སྟོང་དུ་མ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ལྷའི་རོལ་མོ་རྣམས་ཀུན་དུ་རྡུང་བཞིན་དུ་བསྙེན་བཀུར་ཆེན་པོ་བྱས་ནས་རྒྱལ་པོར་དབང་བསྐུར་བས་དབང་བསྐུར་ཏོ།
en: Hundreds of thousands of gods played and sang melodious music for him. Having shown great respect in this way, they crowned him.

source: །བར་སྐབས་དེར་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པ་དང་ལྷ་རྣམས་དགའ་བ་དང་། མགུ་བས་ཡང་རྣམ་པ་སྣ་ཚོགས་པའི་མེ་ཏོག་གི་ཆར་དང་། རིན་པོ་ཆེའི་ཆར་ཡང་ཕབ་སྟེ།
en: “During the coronation, the bodhisattva’s power caused the earth to shake in six different ways. Out of joy and satisfaction, the gods showered flowers and precious gems on Jambudvīpa.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་མེ་ཏོག་དང་རིན་པོ་ཆེའི་ཆར་པུས་མོ་ནུབ་ཙམ་གྱིས་གཡོགས་པར་གྱུར་ཏོ།
en: So many fell that the flowers and gems were piled up to the peoples’ knees.

source: །ལྷ་དང་མི་རྣམས་ཀྱིས་འབྱོར་པ་བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེ་རྣམས་མཐོང་བ་དང་། ངོ་མཚར་དུ་གྱུར་ཅིང་རྨད་དུ་བྱུང་བ་སྐྱེས་ཏེ་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དེ།
en: In sheer amazement at seeing this amount of wealth, the gods and humans exclaimed, ‘Amazing!

source: ཨེ་མའོ་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་བསོད་ནམས་ཀྱི་སྟོབས།
en: How powerful is King Śrīsena’s merit!

source: ཨེ་མའོ་ངོ་མཚར་ཆེའོ།
en: Amazing! It is wondrous!’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷ་བརྒྱ་སྟོང་དུ་མ་དང་ཐབས་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་དགའ་བར་བྱས་ནས་རང་གི་གནས་སུ་སོང་ངོ་།
en: “After thoroughly pleasing the bodhisattva, Śakra, lord of the gods, along with hundreds of thousands of other gods, returned to his abode.

source: །རི་ལ་གནས་པའི་དྲང་སྲོང་དེ་ཡང་འཁོར་ལྔ་བརྒྱ་དང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མངོན་པར་བསྟོད་དེ་བསྟི་གནས་ཉིད་དུ་སོང་ངོ་།
en: The sage and his retinue of five hundred also returned home, after openly praising the bodhisattva.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་མངོན་པར་བཏུད་ཅིང་ཡུན་རིང་དུ་ཆོས་ཀྱི་རྒྱལ་པོ་བྱེད་པར་གྱུར་ཏོ།
en: “After these events, the much-venerated bodhisattva ruled as a Dharma king for a long time.

source: །འཛམ་བུའི་གླིང་གི་དམན་པ་དང་། ལོང་བ་དང་བཀྲེན་པ་དང་སྡུག་ཕོངས་པ་ཐམས་ཅད་ནོར་གྱིས་ཚིམ་པར་བྱས་ནས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཞག་སྟེ།
en: He satiated Jambudvīpa’s poor, blind, hungry, and destitute by granting them wealth, and he led everyone along the path of the ten virtuous actions.

source: འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དྲུག་ཀུན་དགའ་བར་བྱས་ནས་དུས་གཞན་ཞིག་གི་ཚེ་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་རྣམས་དང་དེ་ལྷན་ཅིག་ཏུ་དུས་བྱས་ཏེ་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེས་སོ།
en: He thoroughly satisfied all six classes of gods in the desire realm. At another time, he caused them, along with hundreds of thousands of others, to be reborn in Tuṣita heaven.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཐ་ཚོམ་མམ་ཡིད་གཉིས་སུ་གྱུར་ན་ཁྱེད་རྣམས་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: After telling this tale, the Blessed One said, “Monks, do not have any doubts or confusion that King Śrīsena was someone other than me.

source: །གཞན་དུ་ན་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ཞེས་བྱ་བར་གྱུར་ཏེ། དེའི་ཚེ་རང་གི་ལུས་ཡོངས་སུ་བཏང་ངོ་།
en: At that time, I was the king and I gave away my body.

source: །དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་བཙུན་མོ་རྒྱལ་བའི་འོད་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གྲགས་འཛིན་མ་འདི་ཉིད་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་བཙུན་མོ་རྒྱལ་བའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Monks, the one who was King Śrīsena’s wife back then, Queen Jayaprabhā, is none other than Yaśodharā.

source: །དགེ་སློང་དག་བློན་པོའི་མཆོག་བློ་གྲོས་ཆེན་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་བློན་པོ་བློ་གྲོས་ཆེན་པོར་གྱུར་ཏོ།
en: The supreme one among the ministers, Mahāmati, is none other than the monk Śāriputra.

source: །དགེ་སློང་དག་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་འདི་ཉིད་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་གྱུར་ཏོ། །
en: Śakra, lord of the gods, is none other than King Bimbisāra.

source: དགེ་སློང་དག་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་གང་ཡིན་པ་དེ་རྣམས་ནི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་དང་ལྷན་ཅིག་ཏུ་བདེན་པ་མཐོང་བ་ལྷ་བརྒྱད་ཁྲི་པོ་འདི་ཉིད་ཡིན་ནོ།
en: Those who were the gods of the Heaven of the Thirty-Three at that time are none other than the eighty thousand gods who realized the truth simultaneously with King Bimbisāra.

source: །དགེ་སློང་དག་གྲོང་ཁྱེར་གྱི་སྐྱེ་བོའི་ཚོགས་གང་ཡིན་པ་དེ་ནི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་གང་དག་དང་ཐབས་ཅིག་ཏུ་ངའི་ཐད་དུ་འོངས་པའི་མ་ག་དྷཱའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་འདི་དག་ཉིད་ཡིན་ནོ།
en: The masses of people in the city of Ariṣṭa are none other than the brahmins and householders of Magadha who come to me along with King Bimbisāra.

source: །དགེ་སློང་དག་རི་ལ་གནས་པའི་དྲང་སྲོང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་ཉིད་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་དུ་གྱུར་ཏོ།
en: Monks, the sage who lived in the mountains is none other than the monk Maudgalyāyana.

source: །གང་གིས་ངའི་དྲུང་དུ་བཙུན་མོ་རྒྱལ་བའི་འོད་སློང་བའི་དྲང་སྲོང་བྲམ་ཟེའི་ཁྱེའུ་གང་ཡིན་པ་དེ་ནི་ཤཱཀྱའི་བུ་མོས་འཚོ་མ་འདི་ཉིད་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུར་གྱུར་ཏོ།
en: The young brahmin boy who came to me to beg for Queen Jayaprabhā is none other than the Śākya lady Gopā.

source: །དགེ་སློང་དག་ཤིང་མཁན་གཉིས་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ལྷས་བྱིན་དང་། ཀོ་ཀ་ལི་ཀ་འདི་དག་ཡིན་ཏེ། དེའི་ཚེ་དེའི་དུས་ན་ཤིང་མཁན་གཉིས་སུ་གྱུར་ཏོ།
en: Monks, the two who were carpenters at that time are Devadatta and Kokālika.

source: །སྨོན་ལམ་དེའི་དབང་གིས་འདིར་དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་རྣམ་པ་འདི་ལྟ་བུ་བྱུང་བར་གྱུར་ཏོ།
en: “It is due to the power of his prayers that such miracles of the Thus-Gone One manifested.

source: །དགེ་སློང་དག་དེའི་ཕྱིར་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ།
en: Monks, therefore, you too must train in this way.

source: གང་སྦྱིན་པ་རྣམས་བཏང་བ་དང་བསོད་ནམས་དག་བྱའོ་ཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: You must train by telling yourselves, ‘I will practice generosity and perform meritorious acts.’ ”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་དགེ་སློང་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Blessed One had said these words, the monks rejoiced and praised the Blessed One’s words.

source: སངས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་རྟོགས་པ་བརྗོད་པ་རྫོགས་སོ།། །།
en: This completes “The Account of the Noble Deeds of King Śrīsena.”

source: རྒྱ་གར་གྱི་མཁན་པོ་དྷརྨཱ་ཤྲཱི་བྷ་དྲ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་དགེ་སློང་ཤེས་རབ་ལེགས་པས་བསྒྱུར། སྒྲ་བསྒྱུར་གྱི་ལོཙྪ་བ་ཆེན་པོ་དགེ་སློང་རིན་ཆེན་བཟང་པོས་བཅོས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This was translated by the Indian preceptor Dharmaśrībhadra and the chief editor-translator Sherab Lekpa. It was then revised and finalized by the translator Rinchen Zangpo.
